docs/modules/publishing/freemacs-pdf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en_US" xml:lang="en_US">
<head>
<!-- 2022-07-07 Thu 20:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PDF Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../init.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">PDF Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org35b444b">PDF Tools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="guix">guix</span></span></a>
<ul>
<li><a href="#org331815f">Single Space at the End of Sentences</a></li>
</ul>
</li>
<li><a href="#org93ac01c">End</a></li>
</ul>
</div>
</div>
<hr />


<div id="outline-container-org35b444b" class="outline-2">
<h2 id="org35b444b">PDF Tools&#xa0;&#xa0;&#xa0;<span class="tag"><span class="guix">guix</span></span></h2>
<div class="outline-text-2" id="text-org35b444b">
<p>
<a href="https://github.com/politza/pdf-tools">PDF Tools</a> is a faster and more feature-rich than the built in DocView. Currently, I install this package using the GUIX package manager.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">use-package</span> <span style="color: #df85ff; font-weight: bold;">pdf-tools</span>
  <span style="color: #1ea8fc;">:magic</span> <span style="color: #ff2afc;">(</span><span style="color: #7984D1;">"%PDF"</span> . pdf-view-mode<span style="color: #ff2afc;">)</span>
  <span style="color: #1ea8fc;">:config</span>
  <span style="color: #ff2afc;">(</span>pdf-loader-install <span style="color: #1ea8fc;">:no-query</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org331815f" class="outline-3">
<h3 id="org331815f">Single Space at the End of Sentences</h3>
<div class="outline-text-3" id="text-org331815f">
<p>
Emacs when navigating expects sentences to end with a double space after a period. While this makes documents written in plain text to look more attractive and more readable, this convention is not used much anymore and this will break emacs commands for killing and navigating sentences.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>sentence-end-double-space nil<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org93ac01c" class="outline-2">
<h2 id="org93ac01c">End</h2>
<div class="outline-text-2" id="text-org93ac01c">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-pdf</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">freemacs-pdf.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 20:16&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 20:20</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
